import { z } from "zod";

export const passwordSchema = z.string()
    .min(1, 'كلمة المرور مطلوبة')
    .min(6, "كلمة المرور يجب أن تكون على الأقل 6 أحرف")
    .max(30, "كلمة المرور لا يجب أن تزيد عن 30 حرف")
    .regex(/[A-Z]/, "يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل")
    .regex(/[a-z]/, "يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل")
    .regex(/[0-9]/, "يجب أن تحتوي كلمة المرور على رقم واحد على الأقل")
    .regex(/[@$!%*?&#+\-_.]/, "يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل");

export const emailSchema = z.string()
    .min(1, "البريد الإلكتروني مطلوب")
    .email("البريد الإلكتروني غير صالح");

export const phoneSchema = z.string()
    .min(1, "رقم الهاتف مطلوب")
    .regex(/^(01[0125][0-9]{8}|\+20[0125][0-9]{9})$/, "رقم الهاتف غير صالح");
