using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace Lawyer.Infrastructure.Migrations
{
    /// <inheritdoc />
    public partial class AddCaseTypeTbl : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.RenameColumn(
                name: "Type",
                table: "Cases",
                newName: "CaseTypeId");

            migrationBuilder.CreateTable(
                name: "CaseTypes",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    Title = table.Column<string>(type: "nvarchar(1000)", maxLength: 1000, nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_CaseTypes", x => x.Id);
                });

            migrationBuilder.InsertData(
                table: "CaseTypes",
                columns: new[] { "Id", "Title" },
                values: new object[,]
                {
                    { 1, "قانون الإجراءات الجنائية" },
                    { 2, "قانون الأحوال الشخصية" },
                    { 3, "الجمعيات والمؤسسات الاهلية" },
                    { 4, "الخدمة المدنية والعاملين المدنيين بالدولة" },
                    { 5, "الدستور ومباشرة الحقوق السياسية" },
                    { 6, "العسكري" },
                    { 7, "العمل" },
                    { 8, "المدني" },
                    { 9, "الاثبات" },
                    { 10, "البنك المركزي" },
                    { 11, "الجمارك" },
                    { 12, "قانون الطوارئ وانشاء الدستورية العليا و انشاء محاكم أمن الدولة" },
                    { 13, "المرافعات" },
                    { 14, "التجارة والشركات والأوراق التجارية" },
                    { 15, "العقوبات" },
                    { 16, "تنظيم التعاقدات التي تبرمها الجهات العامة (المناقصات والمزايدات الجديد)" },
                    { 17, "حماية الملكية الفكرية والعلامة التجارية" },
                    { 18, "الاقتصاد والأسواق المالية والرقابة المالية" },
                    { 19, "التأمينات الاجتماعية والمعاشات" },
                    { 20, "الضريبة على الدخل وكسب العمل وضريبة القيمة المضافة والعقارية والدمغة والضريبة على العاملين المصريين بالخارج والفاتورة الالكترونية" },
                    { 21, "مجلس الدولة والقانون الإداري وهيئة قضايا الدولة ولجان توفيق المنازعات" },
                    { 22, "الدولي" },
                    { 23, "قانون الجنسية وقانون دخول وإقامة الأجانب" },
                    { 24, "حماية المال العام" },
                    { 25, "الأسماء التجارية" },
                    { 26, "الموانئ التخصصية" },
                    { 27, "منح التزام المرفق العام" },
                    { 28, "حماية المنافسة ومنع الممارسات الاحتكارية" },
                    { 29, "خطوط انابيب البترول" },
                    { 30, "المناجم والمحاجر" },
                    { 31, "حماية المستهلك" },
                    { 32, "المناطق الاقتصادية ذات الطبيعة الخاصة" },
                    { 33, "الاتحاد المصري لمقاولي التشييد والبناء" },
                    { 34, "حماية الاقتصاد القومي" },
                    { 35, "الغاز الطبيعي" },
                    { 36, "المحاكم الاقتصادية" },
                    { 37, "الضمان الاجتماعي" },
                    { 38, "الرقابة على الشرائط السينمائية" },
                    { 39, "السلك الدبلوماسي والقنصلي" },
                    { 40, "التأمين الصحي" },
                    { 41, "هيئة الشرطة" },
                    { 42, "هيئة تنمية الصعيد" },
                    { 43, "محال بيع العاديات والسلع السياحية" },
                    { 44, "صندوق مواجهة الطوارئ الطبية" },
                    { 45, "سجل المستوردين" },
                    { 46, "الوقف الخيري" },
                    { 47, "زرع الأعضاء البشرية" },
                    { 48, "دمغة صحفية لصالح معاشات الصحفيين" },
                    { 49, "حماية نهر النيل والمجاري المائية من التلوث" },
                    { 50, "تنظيم إدارة المخلفات والقمامة" },
                    { 51, "خدمات النقل البري للركاب باستخدام تكنولوجيا المعلومات برامج اوبر وكريم وغيرها)" },
                    { 52, "استثناء قيد بعض الشركات غير المملوكة للمصريين أو المملوكة لهم بنسبة 51% من بعض أحكام سجل المستوردين العام للدولة المالية العامة الموحد قانون المنشآت الفندقية والسياحية 2022 الوكالة المصرية لضمان الصادرات والاستثمار دعم السياحة والآثار الثروة المائية تنظيم اعمال القياس والمعايرة المترو لوجيا مجلس الشيوخ الوطني للعمل الأهلي التنموي قانون تنظيم انتظار المركبات في الشارع البارك إنشاء البوابة المصرية للعمرة وتنفيذ الشركات السياحية رحلات العمرة إنشاء الجهاز المصري للملكية الفكرية إنشاء المجلس الأعلى لصناعة السيارات وصندوق تمويل صناعة السيارات صديقة البيئة إصدار التحالف صندوق تعاونيات التخطيط" },
                    { 53, "إنشاء المجلس الأعلى لمواجهة الإرهاب والتطرف" },
                    { 54, "إنشاء المركز القومي لإدارة المجال الجوي" },
                    { 55, "إنشاء صندوق تحسين خدمات الرعاية الاجتماعية والصحية لأعضاء هيئة الشرطة وأسرهم" },
                    { 56, "إنشاء وتنظيم المجلس الصحي المصري" },
                    { 57, "تعديل بعض أحكام إعادة تنظيم الأزهر وقانون التعليم المد للمعلمين بعد سن المعاش" },
                    { 58, "تعديل بعض أحكام قانون الأراضي الصحراوية" },
                    { 59, "تعديل بعض أحكام قانون جوازات السفر" },
                    { 60, "تنظيم البحوث الطبية الإكلينيكية" },
                    { 61, "قانون رعاية حقوق المسنين" },
                    { 62, "قانون تنمية المشروعات المتوسطة والصغيرة ومتناهية الصغر" },
                    { 63, "قانون تنظيم مشاركة القطاع الخاص في مشروعات البنية الاساسية والخدمات والمرافق العامة" },
                    { 64, "تنظيم البعثات والمنح والإجازات الدراسية" },
                    { 65, "تنظيم مراقبة الأغذية وتداولها" },
                    { 66, "تنظيم وتشجيع عمل وحدات الطعام المتنقلة" },
                    { 67, "جائزة الدولة للمبدع الصغير" },
                    { 68, "حماية البيانات الشخصية" },
                    { 69, "في شأن شروط شغل الوظائف أو الاستمرار فيها عزل الموظف متعاطي المخدرات»" },
                    { 70, "قانون اجراءات مواجهة الاوبئة والجوائح الصحية" },
                    { 71, "قانون إعادة تنظيم هيئة الأوقاف المصرية" },
                    { 72, "قانون الأحكام المتعلقة بأملاك الدولة الخاصة" },
                    { 73, "قانون الاحوال المدنية" },
                    { 74, "قانون الاستيراد والتصدير" },
                    { 75, "قانون الإسكان الاجتماعي ودعم التمويل العقاري" },
                    { 76, "قوانين التعليم والجامعات الخاصة والأهلية" },
                    { 77, "قانون الثروة المعدنية" },
                    { 78, "قانون السجل التجاري وقانون الحراس الخصوصيين" },
                    { 79, "قانون الموازنة العامة للدولة" },
                    { 80, "قانون إنشاء هيئة تمويل العلوم والتكنولوجيا والابتكار" },
                    { 81, "قانون بإشراف وزارة السياحة على المناطق السياحية واستغلالها" },
                    { 82, "قانون بإنشاء هيئة تنمية واستخدام الطاقة الجديدة والمتجددة" },
                    { 83, "قانون بشأن تحفيز إنتاج الكهرباء من مصادر الطاقة المتجددة" },
                    { 84, "قانون تنظيم الحق في الاجتماعات العامة والمواكب والتظاهرات السلمية" },
                    { 85, "قوانين مهن العلاج الطبيعي والبيطري والتوليد والنقابات" },
                    { 86, "قانون إنشاء اتحاد الكتاب رقم 65 لسنة 1975" },
                    { 87, "قانون تنظيم التعاقدات التي تبرمها الجهات العامة 2018 المناقصات والمزايدات" },
                    { 88, "قانون رقم 8 لسنة 2015 بتنظيم قوائم الكيانات الإرهابية والإرهابيين" },
                    { 89, "قانون انشاء صندوق اعانات طواريء للعمال" }
                });

            migrationBuilder.CreateIndex(
                name: "IX_Cases_CaseTypeId",
                table: "Cases",
                column: "CaseTypeId");

            migrationBuilder.CreateIndex(
                name: "IX_CaseTypes_Title",
                table: "CaseTypes",
                column: "Title",
                unique: true);

            migrationBuilder.AddForeignKey(
                name: "FK_Cases_CaseTypes_CaseTypeId",
                table: "Cases",
                column: "CaseTypeId",
                principalTable: "CaseTypes",
                principalColumn: "Id",
                onDelete: ReferentialAction.Cascade);
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropForeignKey(
                name: "FK_Cases_CaseTypes_CaseTypeId",
                table: "Cases");

            migrationBuilder.DropTable(
                name: "CaseTypes");

            migrationBuilder.DropIndex(
                name: "IX_Cases_CaseTypeId",
                table: "Cases");

            migrationBuilder.RenameColumn(
                name: "CaseTypeId",
                table: "Cases",
                newName: "Type");
        }
    }
}
